//********************************************************* 
/*  文件名：TEST_61F02x_COMP.c
*	功能：  FT61F02x-比较器功能演示
*   IC:    FT61F023 SOP16
*   晶振：  16M/2T                    
*   说明：  程序中将比较器2 C2IN+连接到CVREF = 4/5+(15/32)*5=3.59375V(电源5V)
*		   在C2IN-输入模拟电压,并将比较结果软件输出到DemoPortOut上
*			
*                  FT61F023  SOP16 
*                 ----------------
*  VDD-----------|1(VDD)   (VSS)16|-----------GND     
*  NC------------|2(PA7)   (PA0)15|------------NC 
*  NC------------|3(PA6)   (PA1)14|------------NC
*  NC------------|4(PA5)   (PA2)13|------------NC
*  NC------------|5(PC3)   (PA3)12|---DemoPortOut
*  NC------------|6(PC2)   (PC0)11|---------C2IN+
*  NC------------|7(PA4)   (PC1)10|---------C2IN- 
*  NC------------|8(PC5)   (PC4)09|------------NC
*			      ----------------
*/
//*********************************************************
#include "SYSCFG.H"
#include "..\h\config.h"

/*-------------------------------------------------
 * 函数名称：COMP_INITIAL
 * 功能：   比较器的初始化
 * 输入参数：无
 * 返回参数：无 
 -------------------------------------------------*/
void COMP_INITIAL()
{
	CMCON0 = 0B00000010; 	//四个输入共用2个比较器
				            /*BIT7 C2OUT
				              BIT6 C1OUT
				              BIT5 C2INV 比较器2输出反向 1-反向 0-不反向
				              BIT4 C1INV 比较器1输出反向 1-反向 0-不反向
				              BIT3 CIS比较器输出切换当CM[2:0] = 010 CIS = 1 C1IN+接C1VIN-  C2IN+接C2VIN-
														         CIS = 0 C1IN-接C1VIN-  C2IN-接C2VIN-
										          当CM[2:0] = 001 CIS = 1 C1IN+接C1VIN- 
														          CIS = 0 C1IN-接C1VIN-
				              BIT[2:0]	000-比较器关闭,CxIN管脚模拟I/O管脚
                                        001-三个输入共用2个比较器
							            010-四个输入共用2个比较器 
                                        011-两个共参考比较器 
                                        100-两个独立比较器
							            101-一个独立比较器 
                                        110-两个带输出供参考比较器 
							            111-比较器关闭,CxIN管脚为数字I/O管脚
				            */ 
	CMCON1 = 0B00000000;
	VRCON = 0B10001111;		/* BIT7 VREN CVREF使能位 1-CRVEF电路通电 0-CRVEF电路断电,无泄漏电流
			                   BIT5 VRR  VREF电压范围选择 1-低电平范围 0-高电平范围
			                   BIT[3:0] VR[3:0] CVREF值选择位 
						       VRR = 1时: CVREF = (VR<3:0>/24)*VDD
						       VRR = 0时: CVREF = VDD/4+(VR<3:0>/32)*VDD  	= 5/4+(15/32)*5=3.59375V(电源5V)	
			                */	
    //ANSEL = 0B00110011;	//C1+,C1-,C2+,C2-设置为模拟输入
}