#ifndef _SYSTEM_CLOCK_C_
#define _SYSTEM_CLOCK_C_
/*********************************************************************************************************************/
#include "include/ca51f5_config.h"		
#include "include/ca51f5sfr.h"
#include "include/ca51f5xsfr.h"
#include "include/gpiodef_f5.h"
#include "include/system_clock.h"

#include <intrins.h>
void Delay_ms(unsigned int delay_nms);
/*********************************************************************************************************************/


/***********************************************************************************
函数名  ：		Sys_Clk_Set_IRCH										 	
功能描述：		设置系统时钟为IRCH
输入参数：		无
返回值  ：		无
***********************************************************************************/
void Sys_Clk_Set_IRCH(void)
{
	CKCON |= IHCKE;											//IRCH时钟使能
	CKCON = (CKCON&0xFE) | CKSEL_IRCH;	//系统时钟切换到IRCH
}
/***********************************************************************************/

/***********************************************************************************
函数名  ：		Sys_Clk_Set_IRCL										 	
功能描述：		设置系统时钟为IRCL
输入参数：		无
返回值  ：		无
***********************************************************************************/
void Sys_Clk_Set_IRCL(void)
{
	CKCON |= ILCKE;											//IRCL时钟使能
	Delay_ms(1); //延时 1ms，等待 IRCL 时钟稳定
	CKCON = (CKCON&0xFE) | CKSEL_IRCL;	//系统时钟切换到IRCL	
}
/***********************************************************************************/
/*********************************************************************************************************************/
#endif
