/*******************************************************************************/
#include "pwm.h"
/*******************************************************************************
********************************************************************************/
void pwm2_init()
{	
	P34F = 5;
	CKCON |= IHCKE; //打开 IRCH 时钟
	PWM2DIVH = 0; 	//设置位周期时间
	PWM2DIVL = T_LED_DAT;
	PWM2DUTH = 0; 	//设置位码 0 时间
	PWM2DUTL = T_LED_DAT0_H;
	LEDUTH = 0; 	//设置位码 1 时间
	LEDUTL = T_LED_DAT1_H;
	PWM2CON = PWMIE(0) | PWMTOG(0) | PWMMOD(3) | PWMPOL(0) | PWMCKS_IH; //设置IRCH为PWM时钟
	//源，发送 3 个字节后插入暂停时间
	PWM2CKD = 0; //设置预分频系数，设置为 0 表示不分频
	LEDWTMH = 0; //设置暂停时间
	LEDWTML = 0;//50;
	PWMEN |= (1<<2); //PWM2 使能
}
