
/*********************************************************************************************************************/
#include "timer1.h"
/*********************************************************************************************************************/

void TIMER1_ISR (void) interrupt 3 		 //每10ms中断一次
{
	TH1 = TH_VAL1;
	TL1 = TL_VAL1;
	
}
void timer1_init(void)
{
	TMOD = (TMOD&0xCF)|0x00; 			//模式选择: 定时器1，模式1。
	TH1 = TH_VAL1;    					//高8位装初值
	TL1 = TL_VAL1;    					//低8位装初值
	
	TR1 = 1;       						//定时器1使能  
	ET1 = 1;       						//定时器1中断使能
	PT1 = 0;       						//设置定时器1中断优先级为低优先级
}